import openai
import asyncio

from loader import dp
from aiogram import types

from data.config import AI_GPT_TOKEN

# токен
openai.api_key = AI_GPT_TOKEN

# rate_limit_delay = 3  # seconds

def update(messages, role, content):
    messages.append({'role': role, 'content': content})
    return messages

@dp.message_handler()
async def process_request_message(message: types.Message):
    prompt = message.text
    response = openai.ChatCompletion.create(
        model="gpt-3.5-turbo",
        temperature=0.8,
        messages=[
            {"role": "system", "content": "You are a professional Kyrgyz language document assistant as well as a Kyrgyz language teacher! "},
            {"role": "user", "content": "Кутман таң! Кыргыз тилин үйрөнүү жөнүндө сүйлөшүү үчүн бүгүн бизге кошулганыңыз үчүн рахмат. Келгиле, негиздерден баштайлы. Кыргыз тилин үйрөнүүнү эмне үчүн чечтиңиз?"},
            {"role": "assistant", "content": "Кутман таң! Мен Борбордук Азия маданиятына дайыма суктанып жүрдүм, кыргызстандын, өзгөчө, бай тарыхы жана мурасы бар. Кыргыз тилин үйрөнүү мага жергиликтүү калк менен байланышууга жана алардын каада-салттарын жакшыраак түшүнүүгө жардам берет."},
            {"role": "user", "content": "Бул сонун! Тил үйрөнүү саякатыңызды кантип баштадыңыз? Кандайдыр бир формалдуу класстарды өткөрдүңөрбү?"},
            {"role": "assistant", "content": "Башында кыргыз грамматикасынын жана лексикасынын негиздерин түшүнүү үчүн онлайн ресурстар жана тил үйрөнүү тиркемелери менен баштадым. Кийинчерээк тил институтуна кошулуп, жөндөмүмдү жогорулатуу үчүн формалдуу сабактарды алдым."},
            {"role": "user", "content": "Мага Кыргыз мамлекеттик медициналык академиясынын Профсоюздук кеңешинин отчёттук чогулушу жонундо Кулактандыруу жазып бересинби?"},
            {"role": "assistant", "content": "Кулактандыруу Кыргыз мамлекеттик медициналык академиясынын Профсоюздук кеңешинин отчёттук чогулушу 2011-жылдын 13-майында саат 16:00дө өткөрүлөт. Чогулушка бардык факультеттин окутуучулары жана кызматкерлери катышуусу керек. Күн тартиби: 1. 2010-2011-окуу жылынын жыйынтыгы боюнча окуу жайдын Профсоюздук кеңештин төрагасынын отчётун угуу. 2. Жай мезгилиндеги өргүү убагы үчүн эс алуу жайларына жолдомолорду бөлүштүрүү жөнүндө Профсоюздук кеңешинин мүчөсү А. Жумалиеванын билдирүүсү. Жыйналыш башкы имараттагы кичи конференция залында болот. 19. 04. 2011 Ректорат Чакыруу Урматтуу Самарбек Карымшакович, Түркология факультетинин «Жаңырык» студенттикадабий ийрими 2011-жылдын 20-декабрында өтүүчү адабий-музыкалык кечеге чакырат. Сизди өзүңүздүн илимпоздук, окутуучулук, чыгармачылык, тарбия берүүчүлүк өмүрүңүздүн кызыктуу жерлеринен айтып берет деген ойдобуз. Жери: КТМУнун Ч. Айтматов кампусу, Экономика факультети К. Тыныстанов ат. зал."},
            {"role": "user", "content": "Мага келишимдин улгусун жонотосунбу?"},
            {"role": "assistant", "content": "КЕЛИШИМ «____» _____________2008-ж. Бишкек ш. Бир тараптан Ж. Баласагын ат. Кыргыз улуттук университети, мындан ары «КУУ» деп аталат, ректору ______________________ _______________________ атынан, жана экинчи тараптан Бишкек шаардык Билим берүү башкармалыгы, мындан ары «Башкармалык» деп аталат"},
            {"role": "user", "content": "Ишеним кат деген эмне?"},
            {"role": "assistant", "content": "Ишеним кат – бул бир жактын (ыйгарым укук берүүчү) экинчи жакка (ыйгарым укукка ээ болуучу) жазуу түрүндөгү ишеним артуусу, ыйгарым укук берүүсү. Башкача айтканда, жеке кишинин, жамааттын же уюмдун кызыкчылыгын көздөп, алардын атынан иш жүргүзүү үчүн башка бирөөгө берилген расмий документ. Ишеним каттын үч түрү болот: 1. Бир жолку – бир жолку иш-аракетти аткарууга (мисалы, айлык маянаны, пенсияны, жөлөк пулду, стипендияны ж.б. алууга) берилет. 2. Атайын – бир түрдүү иш-аракеттерди аткарууга (мисалы, ишкананын юристине соттордо ишкананын атынан иш алып барууга) берилет. 3. Жалпы (генералдык) – ишеним артуучунун мүлкүн жалпысынан башкарууга берилет. Маселен, үйлөрдү, жеке унааны; ар кандай курулуш же башка объектилерди сатканда, тийиштүү мөөнөткө пайдаланууга бергенде же мураска өткөргөндө алардын ээси тарабынан башка адамдын атына жазылат. Баалуу буюм болгондуктан нотариалдык кеӊсе же жергиликтүү айыл өкмөтү тарабынан тастыкталат."},
            {"role": "user", "content": "Мага келишимдин улгусун жонотосунбу?"},
            {"role": "assistant", "content": "КЕЛИШИМ «____» _____________2008-ж. Бишкек ш. Бир тараптан Ж. Баласагын ат. Кыргыз улуттук университети, мындан ары «КУУ» деп аталат, ректору ______________________ _______________________ атынан, жана экинчи тараптан Бишкек шаардык Билим берүү башкармалыгы, мындан ары «Башкармалык» деп аталат"},
            {"role": "user", "content": prompt}
        ]
    )
    await message.reply(response['choices'][0]['message']['content'])
